dsbaars/btclock_v4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Rev A and Rev B both ship ESP32-S3 with 2 MB quad PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_FREERTOS_HZ=1000

# The main task runs the render + SSE status-broadcast path in
# main.cpp's app_main loop. With the screen_manager renderer (font
# rasterisation, on-stack panel composition) and an active SSE client
# subscribed, the default 3584 B stack overflows during a rotation —
# deterministic crash observed on Rev B with 'A stack overflow in task
# main has been detected' and vApplicationStackOverflowHook in the
# backtrace. 8 KiB gives ~2x headroom over the observed peak.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# TLS root certs for ws.btclock.dev — use the bundled CA store rather
# than embedding a specific root, so the client keeps working if the
# upstream cert is rotated under an existing trusted CA.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS buffer tuning — Rev B has three concurrent TLS clients (price WSS
# to ws.btclock.dev, Nostr WSS to relay.primal.net, mining-pool HTTPS
# poller; the bitaxe poller is plain HTTP and pays no TLS cost). With
# default symmetric 16 KiB IN + 4 KiB OUT per session, ~60 KiB of
# internal heap is parked in mbedtls buffers even while idle — on 2 MB
# PSRAM Rev B that leaves steady-state free internal heap at ~32 KiB,
# too thin for handshake storms on reconnect. Three complementary knobs
# below cut that cost:
#
#  1. DYNAMIC_BUFFER frees the IN/OUT buffers between TLS records so an
#     idle connection holds ~0 bytes of buffer instead of ~20 KiB.
#  2. SSL_IN_CONTENT_LEN=4096 caps the worst-case transient allocation
#     at 16 KiB — Cloudflare-fronted endpoints (mempool.space) send a
#     ServerHello + Certificate chain that exceeds 4 KiB, which trips
#     MBEDTLS_ERR_SSL_FATAL_ALERT_MESSAGE during handshake when the
#     buffer is too small. Bumping to the TLS record max (16 KiB) with
#     DYNAMIC_BUFFER on means the cost is paid only while the
#     handshake/large-frame is in flight; idle connections shrink back.
#  3. SSL_OUT_CONTENT_LEN=2048 — we only send tiny subscribe frames +
#     GET request lines, never >1 KiB.
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

CONFIG_PARTITION_TABLE_CUSTOM=y
# Flash size + partition CSV live in the per-variant sdkconfig.defaults.<rev>.
